In [1]:
import pandas as pd
import numpy as np

In [16]:
data = pd.read_csv('Metrail+dataset.csv')

In [17]:
data.head()

    Month  Travellers('000)
0  Jan-91            1724.0
1  Feb-91            1638.0
2  Mar-91            1987.0
3  Apr-91            1825.0
4  May-91               NaN

In [27]:
data.rename(columns={'Travellers(\'000)':'Travellers'}, inplace = True)
data.head()

    Month  Travellers
0  Jan-91      1724.0
1  Feb-91      1638.0
2  Mar-91      1987.0
3  Apr-91      1825.0
4  May-91         NaN

In [64]:
data = data.assign(Travellers_Last_Observed = data.Travellers.fillna(method ='pad'))

In [65]:
data.head()

    Month  Travellers  Travellers_Last_Observed
0  Jan-91      1724.0                    1724.0
1  Feb-91      1638.0                    1638.0
2  Mar-91      1987.0                    1987.0
3  Apr-91      1825.0                    1825.0
4  May-91         NaN                    1825.0

In [66]:
data.Travellers_Last_Observed.mean()

1838.685534591195

In [67]:
data = data.assign(Travellers_Last_Observed = data.Travellers.interpolate(method ='linear'))
data.head()
data.Travellers_Last_Observed.mean()

1836.566037735849

In [68]:
data = data.assign(Travellers_Last_Observed = data.Travellers.fillna(method ='bfill'))
data.head()
data.Travellers_Last_Observed.mean()

1834.446540880503